[
  {
    "date": "December 15, 2025",
    "title": "Example of a title",
    "content": "<p>It has been over TWO YEARS since the last time I wrote something here.</p><p>So much has changed.</p><p>I am about to do the biggest show I have ever done in Denver on the 20th of this month, and it felt appropriate to finally write something given the momentous occasion. As many of you know, Spider Gang has been over for some time. It feels funny because the last time I was writing an entry for the website we were at our peak as a group.</p><p>Now we have all gone our separate ways for better or for worse. I keep up with many of the boys who tour with me and who remain friendly, and have drifted away from others which I won't get into for personal reasons. The fact is that life has been even more positive for me since then.</p><p>My solo career has been an incredible journey. I have toured the United states 4 times, Europe 3 times, Australia and New Zealand twice, done a number of festivals, and even done a show in Brazil! If you told the boys and I back in 2021 what we would go on to accomplish, we would have laughed in your face and finished ripping whatever bong we were perpetually holding.</p><p>2025 will be the first year that I have been completely sober since I was 17 years old. I am 27 now and I definitely view things differently than I did as a drug addled crazy person making internet music. I still think that all people are equal regardless of their race, and that the construct serves to do nothing but divide, but I am definitely more sensitive towards others than before. I understand that pissing people off and being insensitive is not necessarily the path to fixing the world, and that being more kind and understanding of others perspectives is a much better way to have an open dialogue with them AND possibly affect real change.</p><p>I don't regret any of my decisions or works of art. They are powerful statements in a world where many are too afraid to make them. I do, however, want to make new decisions and statements now that I am older! So that is what i'll do. There are many who still call me names, and bully the people that support me, but I have always and will continue to prove them wrong every day.</p><p>I have many plans for the future. I will be taking a break from touring in 2026 for a few reasons: <ol><li>I am physically tired. Between the strain on my voice, eating like shit because America insists on not being able to provide healthy food to its traveling citizens, and the injuries I have sustained on the road, I need a break to rehabilitate.</li><li>I am emotionally tired. Being on the road takes a strain on the human psyche that people who have never done it cannot understand. I need moments to myself to spend time with family, read a book or two, create freely, and have fun.</li><li>I want to curate better live experiences! My show has gotten to the point where I feel like it needs time to change. I want to experiment with intimate acoustic live shows, make music that can be more easily translated to a live setting, throw secret events, and maybe even host events like art exhibits and film screenings where music is only one aspect.</li></ol></p><p>Some of my other plans for the future include making music under my real name, finishing some of the work I have started under the Lil Darkie persona, participating in group projects and bands, developing a more consistent exercise plan for next year, working on some pet projects such as a children's book, write fantasy stories, come on tour with my friends but NOT as the lead singer (I can help run the merch stand and take pictures HAHA), and maybe even become a DM for Dungeons and Dragons.</p><p>I want to thank the people who support me for making what I do possible. I think that it is more important now than ever before for people to go against the status quo. For people to grin in the face of danger and opposition. And to spread love in a world where negativity seeks to unhinge its grotesque jaw and consume everything it finds. In a world where evil poses as the light, be dark. And be proud.</p><p>Until the next time I write you all. Take care of yourselves. You are never alone. We have one another.</p>"
  },
  {
    "date": "September 3, 2022",
    "title": "Example of a title",
    "content": "It has been over a year since the last time I wrote something here. Truth be told it's easier to do this job when you don't talk about it. Because if you talk about it you have to think about it. Making art for people on the internet to see is a challenging job for a number of reasons. You never know who you're really working with when you choose to make a song with someone. You never know who really likes you and who is just acting like it right now to get something out of it. You never know how thinking about the internet all the time will affect you. You never know how long this all will last. How many more times will I be able to get on a stage in front of hundreds of people? How many more songs do I have in me? Can I put out this song I just made even though it's so different? Will people ever accept and love me for who I truly am? Are people ready for the new ideas I have? I guess the answer is that I don't know, and the best course of action is usually to not do anything that makes you have to consider those things. The last year has been incredible despite how lost and woeful the beginning of this entry may be. I traveled all over Europe and performed for thousands of people. The beauty in experience was immeasurable. I sat down for a month with the boys and worked on a project. It's coming along well and I observe we are finding ourselves as a group through making it; we're getting closer to figuring out what Spider Gang even is to us. Up until this point it has been a group of friends making music for fun and nothing more. Now it feels like it's becoming something greater, something it's always destined to be. Something that can serve to inspire and hopefully empower. We went on tour all over the US and saw how hard work and dedication can pay off. We came back to places we had gone before and did even bigger sold out shows, and even went to places we had never gone to see more new faces. Now I sit here fresh off the backs of these beautiful experiences and I can tell you with great certainty that I don't care how many more times will I be able to get on a stage in front of hundreds of people, or how many more songs I have in me. I am enjoying this time to its fullest. That is where I have been the past year. Enjoying my time. Thank you for reading this. I don't know when I will be back but I guess I will decide later. For now I sleep."
  },
  {
    "date": "August 9, 2022",
    "title": "Another  exmaple of a title",
    "content": "Today we are announcing the Spider Gang East Coast Tour. It is an incredible feeling knowing that something that was once just a pipe dream in a shitty apartment is now a real tangible thing. we are all working hard as hell to make sure it goes well and it's scary as well as exciting. there's a lot going on right now, a lot of which i can't talk about because it would ruin the surprise. however, i can say one thing:\n\nyeti.\n\nnow that i got that over with, i hope you have a good day whenever you are reading this and never give up. you can change the world, just don't listen to the naysayers and people who misunderstand you. if you mean to do good in your heart, you will do good and you will be rewarded for it. namaste, til next time."
  },
  {
    "date": "June 23, 2021",
    "title": "Another  exmaple of a title",
    "content": "it's been a few weeks since i last wrote. today has been super stupid so far. i've been having arguments with people i love and i feel like the life is draining out of me. i really just want everything to be okay and sometimes it's hard to tell if i am the problem, if the other people around me are the problem, or both. my body dysmorphia is better but definitely still there and i just want to get over it. there's still a lot of work to do though. i can't stop now. i am thankful for the opportunities before me and i will not give up."
  },
  {
    "date": "June 9, 2021",
    "title": "Another  exmaple of a title",
    "content": "i have decided that i am going to be writing here for everyone to see. i am doing this because i think it will be cool to reflect on! today i woke up and hung out with MK and John. we watched Reggie Watts and i ate some egg with ground beef, spinach, and bacon with some toast. eating has been hard lately because although i have been off of alcohol and tobacco for going on 6 months now, my body still relies on marijuana to feel hunger sometimes and that's wrong. i have been wanting to get off of all substances for a bit now but haven't found it within myself to fully let go. i've been changing physically and i feel much better about my health, but i know that i am still holding myself back from becoming as great as i can be. it's hard sometimes with everything going on every day to stand above it. my nose isn't under the surface but i can feel the swamp pulling at my ankles, begging me to give into the hatred and pain that i feel every day and become consumed in it. i won't allow it. i have come too far and done too much good to stop. i will enjoy today and i hope you will too no matter who you are. i am the little darkie. we are the same"
  }
]
